---
kind: method
id: M:Autodesk.Revit.DB.PaperSourceSet.Contains(Autodesk.Revit.DB.PaperSource)
source: html/7999edb6-f6c4-720d-e9b7-1fcdbb708e31.htm
---
# Autodesk.Revit.DB.PaperSourceSet.Contains Method

Tests for the existence of an item within the set.

## Syntax (C#)
```csharp
public virtual bool Contains(
	PaperSource item
)
```

## Parameters
- **item** (`Autodesk.Revit.DB.PaperSource`) - The item to be searched for.

## Returns
The Contains method returns True if the item is within the set, otherwise False.